[
  {
    "term": "Actuator",
    "definition": "A component at the back of the plug that throws the bolt or unlocks the shackle when the plug is turned."
  },
  {
    "term": "Anti-drill element",
    "definition": "Components in a lock made of hardened steel to slow down or prevent drilling attacks. Can be parts of the lock body itself, pin inserts in the lock body or plug, or in the pins, or the pins themselves."
  },
  {
    "term": "Ball bearing locking mechanism (padlocks)",
    "definition": "Unshimmable mechanism in padlocks where ball bearings are pushed into the shackle to prevent opening."
  },
  {
    "term": "Barrel driver pin",
    "definition": "Name given to any driver pin with a shape similar to a “barrel”, having a portion near the extremities with a reduction in diameter, then flaring out at the end. Usually referring to the ASSA version, can also be used for other varieties like the DOM barrels."
  },
  {
    "term": "Barrel key / Pin key",
    "definition": "A key for a lever lock where the shaft of the key is a solid cylinder."
  },
  {
    "term": "Bible",
    "definition": "The part of a pin tumbler lock where the driver pins and springs reside."
  },
  {
    "term": "Bible Cover",
    "definition": "A cover plate that is sometimes on top of the bible. Can be removed for gutting."
  },
  {
    "term": "Binding",
    "definition": "The resistance to motion of an unset pin due to friction, usually against the sides of the bible chamber, when tensioning."
  },
  {
    "term": "Bitting",
    "definition": "The unique cuts in a key that move tumblers to specified places when inserted."
  },
  {
    "term": "Bitting Code",
    "definition": "An alphanumeric code that can be provided to a locksmith to cut a key to a desired shape. Some codes may be found on the keys themselves, other times in key cards that are obtained along with the lock."
  },
  {
    "term": "BOK",
    "definition": "(1) Bottom Of the Keyway - the area of the keyway opposite to the pins in a normal pin tumbler; corresponds to the inferior area of the keyway when the bible is upwards; in regular euro cylinder installation, with the bible downwards, will be the top part of the keyway. (2) BOK (tensioners): name colloquially given for tensioners used in the bottom of the keyway"
  },
  {
    "term": "Dimple (Lock)",
    "definition": "Generally used to identify a certain subtype of pin tumblers in which the coding is marked on the key mainly on the flat side; this distinction is useful from a tool choice perspective; although used to refer to the lock type itself, this isn’t technically correct, as the word “dimple” actually designates the round markings on the wide face of the key where the keypins make contact."
  },
  {
    "term": "Driver Pin",
    "definition": "The pins that sit usually at shearline in a pin tumbler lock, preventing the rotation of the plug, and sit between a keypin and a spring. They must be fully lifted into the bible to open the lock. Also known as top pin when bible is upwards. Can include security features."
  },
  {
    "term": "Fingerpin",
    "definition": "Subtype of sidepin with extended prong that interacts with the key, and vertical rotational as well as vertical lift coding (must be lifted and rotated). Generally associated to a sidebar."
  },
  {
    "term": "HPC",
    "definition": "(1) High Pin Count (locks) - although the use can be flexible, one acceptable definition is \"a lock with 8 or more active and independent pin stacks, from at least 2 different rows from different directions\". (2) brand of picks sold mainly in USA"
  },
  {
    "term": "Key Pin (or Keypin)",
    "definition": "The pins in the plug in a pin tumbler lock, that are lifted by the key to lift the driver pins. Their size corresponds to the code for a key cut. When a key with the correct cut size in that position is inserted, the keypin lifts the driver pin just above the shear line. Also known as bottom pin when the bible is upwards. Can include security features."
  },
  {
    "term": "Lever",
    "definition": "(1) Coding element shaped like a flat piece of metal, that rotates about one point, interacting with the locking elements, which can be, for example. a sidebar or a talon, depending on the type of lever lock. (2) Italian levers (and silmilar types) are technically not lever locks as they don't rotate about one point, but are traditionally called levers."
  },
  {
    "term": "Pin Tumbler",
    "definition": "Any lock using stacks of pins composed by a coding keypin and a driver pin. Although generally used for locks with vertical keyways with pins coming from the bible side, and opened with vertical keys coded on one edge, the group technically includes also the so-called dimple locks."
  },
  {
    "term": "Sidepin",
    "definition": "Pin or pin-like element that works as a secondary locking mechanism. Can include various pin types like fingerpins, sliders, active and passive pin elements, among others with no specific designation."
  },
  {
    "term": "Slider",
    "definition": "Element that moves in only one direction in the lock, usually without pushing directly other pins or elements, and is kept rotationally locked to maintain correct contact with the functional elements it interacts with. It can be the main or secondary locking mechanism of a lock. Can be Sprung or Unsprung."
  },
  {
    "term": "TOK",
    "definition": "(1) Top Of the Keyway - the area of the keyway on the same side of the pins in a normal pin tumbler; corresponds to the superior area of the keyway when the bible is upwards; in regular euro cylinder installation, with the bible downwards, will be the bottom part of the keyway. (2) TOK (tensioners): name colloquially given for tensioners used in the top of the keyway"
  },
  {
    "term": "Wafer",
    "definition": "A flat and wide coding element of a lock that slides in one direction, interacting with the locking elements, generally the lock body and the key."
  }
]